In [7]:
import pandas as pd
import numpy as np

In [3]:
# pd.series can take in a dict and turn keys into index 
my_dict = {'name': 'serena', 'hobby': 'piano'}
print(pd.Series(my_dict))

name     serena
hobby     piano
dtype: object

In [6]:
# add with fill na
q1 = pd.Series({'Japan': 80, 'China': 450, 'India': 200, 'USA': 250})
q2 = pd.Series({'Brazil': 100,'China': 500, 'India': 210,'USA': 260})
q1.add(q2,fill_value=0)

Brazil    100.0
China     950.0
India     410.0
Japan      80.0
USA       510.0
dtype: float64

In [13]:
# create a df from np.array 
data = np.random.randint(1, 10, (3,3))
col_names = ['one', 'two', 'three']
index_names = ['a', 'b', 'c']
df = pd.DataFrame(data, index=index_names, columns=col_names)
print(df)

   one  two  three
a    6    7      3
b    5    4      9
c    6    7      1

In [14]:
# df basics 
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, a to c
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   one     3 non-null      int64
 1   two     3 non-null      int64
 2   three   3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [16]:
df.describe().transpose()

       count      mean       std  min  25%  50%  75%  max
one      3.0  5.666667  0.577350  5.0  5.5  6.0  6.0  6.0
two      3.0  6.000000  1.732051  4.0  5.5  7.0  7.0  7.0
three    3.0  4.333333  4.163332  1.0  2.0  3.0  6.0  9.0

In [17]:
df.one.dtype

dtype('int64')

In [19]:
df.shape

(3, 3)

In [18]:
# columns drop
df.drop('one', axis=1)

   two  three
a    7      3
b    4      9
c    7      1

In [20]:
# index drop 
df.drop('a')

   one  two  three
b    5    4      9
c    6    7      1

In [28]:
# apply method (only takes in a single value and return a single value per row)
"""
1. lambda function is just an anoynimous function 
"""

df = pd.read_csv('UNZIP_FOR_NOTEBOOKS_FINAL//03-Pandas//tips.csv')

## 1. single column 
def last_four(num):
    return str(num)[-4:]
df['last_four'] = df['CC Number'].apply(last_four)


# 2. use lambda function
print(df['total_bill'].apply(lambda bill:bill*0.18))

# 3. multiple columns 
import timeit 
  
# code snippet to be executed only once 
setup = '''
import numpy as np
import pandas as pd

df = pd.read_csv('UNZIP_FOR_NOTEBOOKS_FINAL//03-Pandas//tips.csv')

def quality(total_bill,tip):
    if tip/total_bill  > 0.25:
        return "Generous"
    else:
        return "Other"
'''
  
# code snippet whose execution time is to be measured 
stmt_one = ''' 
df['Tip Quality'] = df[['total_bill','tip']].apply(lambda df: quality(df['total_bill'],df['tip']),axis=1)
'''

stmt_two = '''
df['Tip Quality'] = np.vectorize(quality)(df['total_bill'], df['tip'])
'''

print(timeit.timeit(setup = setup, 
                    stmt = stmt_one, 
                    number = 1000))
print(timeit.timeit(setup = setup, 
                    stmt = stmt_two, 
                    number = 1000) )

0      3.0582
1      1.8612
2      3.7818
3      4.2624
4      4.4262
        ...
239    5.2254
240    4.8924
241    4.0806
242    3.2076
243    3.3804
Name: total_bill, Length: 244, dtype: float64
3.8880851560024894
0.38158175299759023

In [29]:
# idxmax & idxmin
df['total_bill'].idxmax()

170

In [30]:
# value counts 
df['sex'].value_counts()

Male      157
Female     87
Name: sex, dtype: int64

In [35]:
# replace values 
"""
1. a few columns
"""
def quality(total_bill,tip):
    if tip/total_bill  > 0.25:
        return "Generous"
    else:
        return "Other"
df['Tip Quality'] = np.vectorize(quality)(df['total_bill'], df['tip'])
df['Tip Quality'] = df['Tip Quality'].replace(to_replace='Other',value='Ok')
print(df.head())


"""
2. multiple columns
"""
my_map = {'Dinner':'D','Lunch':'L'}
df['time'].map(my_map)

   total_bill   tip     sex smoker  day    time  size  price_per_person  \
0       16.99  1.01  Female     No  Sun  Dinner     2              8.49
1       10.34  1.66    Male     No  Sun  Dinner     3              3.45
2       21.01  3.50    Male     No  Sun  Dinner     3              7.00
3       23.68  3.31    Male     No  Sun  Dinner     2             11.84
4       24.59  3.61  Female     No  Sun  Dinner     4              6.15

           Payer Name         CC Number Payment ID last_four Tip Quality
0  Christy Cunningham  3560325168603410    Sun2959      3410          Ok
1      Douglas Tucker  4478071379779230    Sun4608      9230          Ok
2      Travis Walters  6011812112971322    Sun4458      1322          Ok
3    Nathaniel Harris  4676137647685994    Sun5260      5994          Ok
4        Tonya Carter  4832732618637221    Sun2251      7221          Ok

0      D
1      D
2      D
3      D
4      D
      ..
239    D
240    D
241    D
242    D
243    D
Name: time, Length: 244, dtype: object

In [36]:
# between 
df[df['total_bill'].between(10,20,inclusive=True)].head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,last_four,Tip Quality
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,3410,Ok
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,9230,Ok
8,15.04,1.96,Male,No,Sun,Dinner,2,7.52,Joseph Mcdonald,3522866365840377,Sun6820,0377,Ok
9,14.78,3.23,Male,No,Sun,Dinner,2,7.39,Jerome Abbott,3532124519049786,Sun3775,9786,Ok
10,10.27,1.71,Male,No,Sun,Dinner,2,5.14,William Riley,566287581219,Sun2546,1219,Ok

In [38]:
# sample 
print(df.sample(5))
print(df.sample(frac=0.01))

     total_bill   tip   sex smoker   day    time  size  price_per_person  \
112       38.07  4.00  Male     No   Sun  Dinner     3             12.69
89        21.16  3.00  Male     No  Thur   Lunch     2             10.58
95        40.17  4.73  Male    Yes   Fri  Dinner     4             10.04
152       17.26  2.74  Male     No   Sun  Dinner     3              5.75
40        16.04  2.24  Male     No   Sat  Dinner     3              5.35

        Payer Name         CC Number Payment ID last_four Tip Quality
112     Jeff Lopez  3572865915176463     Sun591      6463          Ok
89     Keith Lewis  4356005144080422   Thur6273      0422          Ok
95   Aaron Bentley   180026611638690    Fri9628      8690          Ok
152  Gregory Smith     4292362333741    Sun5205      3741          Ok
40    Adam Edwards  3544447755679420    Sat8549      9420          Ok
     total_bill  tip     sex smoker  day    time  size  price_per_person  \
100       11.35  2.5  Female    Yes  Fri  Dinner     2              5.68
178        9.60  4.0  Female    Yes  Sun  Dinner     2              4.80

       Payer Name       CC Number Payment ID last_four Tip Quality
100    Lori Lynch  38558279384492    Fri4106      4492          Ok
178  Melanie Gray   4211808859168    Sun4598      9168    Generous

In [39]:
# nlargest
df.nlargest(5, 'tip')

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,last_four,Tip Quality
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954,8236,Ok
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590,5212,Ok
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239,9808,Ok
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139,0595,Ok
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025,8508,Ok

In [44]:
# multi-index/cross-section group by 
df = pd.read_csv('UNZIP_FOR_NOTEBOOKS_FINAL//03-Pandas//mpg.csv')
year_cyl = df.groupby(['model_year','cylinders']).mean()
print(year_cyl.index.levels)

# single row
print(year_cyl.loc[(70,8)]) 

# cross-section
print(year_cyl.xs(key=70,axis=0,level='model_year'))

# swap levels
print(year_cyl.swaplevel().head())

# sort 
print(year_cyl.sort_index(level='model_year',ascending=False))

# group by 
print(df.groupby('model_year').agg({'mpg':['median','mean'],'weight':['mean','std']}))

[[70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82], [3, 4, 5, 6, 8]]
mpg               14.111111
displacement     367.555556
weight          3940.055556
acceleration      11.194444
origin             1.000000
Name: (70, 8), dtype: float64
                 mpg  displacement       weight  acceleration    origin
cylinders
4          25.285714    107.000000  2292.571429     16.000000  2.285714
6          20.500000    199.000000  2710.500000     15.500000  1.000000
8          14.111111    367.555556  3940.055556     11.194444  1.000000
                            mpg  displacement       weight  acceleration  \
cylinders model_year
4         70          25.285714    107.000000  2292.571429     16.000000
6         70          20.500000    199.000000  2710.500000     15.500000
8         70          14.111111    367.555556  3940.055556     11.194444
4         71          27.461538    101.846154  2056.384615     16.961538
6         71          18.000000    243.375000  3171.875000     14.750000

                        origin
cylinders model_year
4         70          2.285714
6         70          1.000000
8         70          1.000000
4         71          1.923077
6         71          1.000000
                            mpg  displacement       weight  acceleration  \
model_year cylinders
82         6          28.333333    225.000000  2931.666667     16.033333
           4          32.071429    118.571429  2402.321429     16.703571
81         8          26.600000    350.000000  3725.000000     19.000000
           6          23.428571    184.000000  3093.571429     15.442857
           4          32.814286    108.857143  2275.476190     16.466667
80         6          25.900000    196.500000  3145.500000     15.050000
           5          36.400000    121.000000  2950.000000     19.900000
           4          34.612000    111.000000  2360.080000     17.144000
           3          23.700000     70.000000  2420.000000     12.500000
79         8          18.630000    321.400000  3862.900000     15.400000
           6          22.950000    205.666667  3025.833333     15.433333
           5          25.400000    183.000000  3530.000000     20.100000
           4          31.525000    113.583333  2357.583333     15.991667
78         8          19.050000    300.833333  3563.333333     13.266667
           6          19.066667    213.250000  3314.166667     16.391667
           5          20.300000    131.000000  2830.000000     15.900000
           4          29.576471    112.117647  2296.764706     16.282353
77         8          16.000000    335.750000  4177.500000     13.662500
           6          19.500000    220.400000  3383.000000     16.900000
           4          29.107143    106.500000  2205.071429     16.064286
           3          21.500000     80.000000  2720.000000     13.500000
76         8          14.666667    324.000000  4064.666667     13.222222
           6          20.000000    221.400000  3349.600000     17.000000
           4          26.766667    106.333333  2306.600000     16.866667
75         8          15.666667    330.500000  4108.833333     13.166667
           6          17.583333    233.750000  3398.333333     17.708333
           4          25.250000    114.833333  2489.250000     15.833333
74         8          14.200000    315.200000  4438.400000     14.700000
           6          17.857143    230.428571  3320.000000     16.857143
           4          27.800000     96.533333  2151.466667     16.400000
73         8          13.200000    365.250000  4279.050000     12.250000
           6          19.000000    212.250000  2917.125000     15.687500
           4          22.727273    109.272727  2338.090909     17.136364
           3          18.000000     70.000000  2124.000000     13.500000
72         8          13.615385    344.846154  4228.384615     13.000000
           4          23.428571    111.535714  2382.642857     17.214286
           3          19.000000     70.000000  2330.000000     13.500000
71         8          13.428571    371.714286  4537.714286     12.214286
           6          18.000000    243.375000  3171.875000     14.750000
           4          27.461538    101.846154  2056.384615     16.961538
70         8          14.111111    367.555556  3940.055556     11.194444
           6          20.500000    199.000000  2710.500000     15.500000
           4          25.285714    107.000000  2292.571429     16.000000

                        origin
model_year cylinders
82         6          1.000000
           4          1.714286
81         8          1.000000
           6          1.714286
           4          2.095238
80         6          2.000000
           5          2.000000
           4          2.200000
           3          3.000000
79         8          1.000000
           6          1.000000
           5          2.000000
           4          1.583333
78         8          1.000000
           6          1.166667
           5          2.000000
           4          2.117647
77         8          1.000000
           6          1.400000
           4          1.857143
           3          3.000000
76         8          1.000000
           6          1.300000
           4          1.866667
75         8          1.000000
           6          1.000000
           4          2.166667
74         8          1.000000
           6          1.000000
           4          2.200000
73         8          1.000000
           6          1.250000
           4          2.000000
           3          3.000000
72         8          1.000000
           4          1.928571
           3          3.000000
71         8          1.000000
           6          1.000000
           4          1.923077
70         8          1.000000
           6          1.000000
           4          2.285714
              mpg                  weight
           median       mean         mean          std
model_year
70          16.00  17.689655  3372.793103   852.868663
71          19.00  21.250000  2995.428571  1061.830859
72          18.50  18.714286  3237.714286   974.520960
73          16.00  17.100000  3419.025000   974.809133
74          24.00  22.703704  2877.925926   949.308571
75          19.50  20.266667  3176.800000   765.179781
76          21.00  21.573529  3078.735294   821.371481
77          21.75  23.375000  2997.357143   912.825902
78          20.70  24.061111  2861.805556   626.023907
79          23.90  25.093103  3055.344828   747.881497
80          32.70  33.696552  2436.655172   432.235491
81          31.60  30.334483  2522.931034   533.600501
82          32.00  31.709677  2453.548387   354.276713

In [ ]:
# pandas and text 
tech_finance = ['GOOG,APPL,AMZN','JPM,BAC,GS']
print(tickers = pd.Series(tech_finance))
tickers.str.split(',',expand=True)